[PAD]
[SEP]
[CLS]
[UNK]
[MASK]
10
1000
1001
1003
1004
1005
1006
1007
1008
1009
1010
1011
1013
1014
1015
1016
1017
1019
1020
1021
1022
1023
1024
1025
1027
1028
1029
1030
1031
1033
1034
1035
1037
1038
1039
1040
1041
1042
1043
1044
1045
1046
1047
1048
1049
1050
1051
1052
1053
1054
1055
1056
1057
1058
1059
1060
1061
1062
1063
1064
1065
1066
1067
1068
1069
107
1070
1071
1072
1073
1074
1075
1076
1077
1078
1079
1080
1081
1082
1083
1084
1085
1086
1087
1088
1089
109
1090
1091
1092
1093
1094
1095
1096
1097
1098
1099
11
1101
1102
1103
1104
1107
1108
1109
1110
1111
1112
1113
1114
1115
1116
113
1143
1144
1151
1152
117
1176
1189
12
1207
1208
1209
1211
1212
1214
1215
122
1220
1221
1222
1224
1225
1237
124
1240
1241
1244
1245
1249
125
1252
1253
126
127
1272
1273
1274
1276
1277
1278
128
1280
1281
1285
129
13
130
1305
1306
1307
1309
131
1310
132
1329
1339
134
1340
1342
1343
1345
1346
1350
1351
1352
1353
1354
1355
1356
1357
1374
1375
1376
1377
1378
1380
1381
1382
1383
1384
1385
1386
1387
1389
1390
1391
1392
1395
1396
14
1401
1410
1411
1413
1414
1416
1417
1418
1419
142
1420
1427
1428
143
1430
1431
1433
1435
1437
1445
1448
1454
1457
1459
1460
1461
1463
1465
1467
1469
1471
1472
1473
1478
1480
1481
1482
1483
1484
1485
1488
1489
1492
1493
15
1500
1506
1507
1508
1509
151
1512
1518
1519
1521
153
154
1548
1549
155
1550
1551
1552
1554
1558
1559
1561
1574
1575
1576
1577
1578
1579
1580
1581
1582
1583
1584
1585
1586
1587
1588
1589
159
1590
1591
1592
1593
1594
1595
1596
1597
1598
1599
16
160
1600
1602
1606
1609
161
1610
1613
1617
1618
162
1620
1621
1622
1623
1624
1625
1626
1627
163
164
165
166
167
17
170
171
176
1764
1766
177
1775
18
180
181
186
187
188
189
19
190
191
192
193
196
197
198
199
20
200
201
202
204
205
206
207
208
209
21
210
213
214
215
216
217
218
219
22
225
227
229
23
230
231
232
233
234
235
236
237
238
239
24
240
241
242
243
244
245
246
247
248
249
250
251
253
254
255
256
258
259
26
260
261
262
263
264
267
268
269
27
270
271
272
273
274
275
276
277
278
279
28
280
281
282
283
284
285
286
287
288
289
290
291
293
294
298
299
30
300
301
302
303
304
305
306
307
308
309
31
310
314
315
316
317
318
319
320
322
323
335
336
337
338
34
341
35
351
352
353
354
355
356
357
358
359
360
361
362
363
364
365
366
367
368
369
37
370
371
372
373
374
375
376
377
378
379
380
381
382
383
384
385
386
387
388
389
390
391
392
393
394
395
396
397
398
40
402
403
404
41
416
42
421
422
423
424
425
426
427
43
430
433
434
436
437
438
439
44
440
441
442
443
444
445
446
447
448
449
450
451
452
453
454
455
456
457
458
459
46
460
461
462
463
464
465
466
467
468
469
470
471
472
473
474
475
476
477
478
479
48
480
482
483
484
485
486
487
488
489
490
491
492
493
494
496
498
499
5
500
502
503
504
519
520
521
522
523
526
527
528
53
531
533
534
535
536
537
538
539
541
542
543
544
545
546
547
548
549
55
550
551
552
553
554
555
556
557
558
559
56
560
561
562
563
564
565
566
567
568
569
570
571
572
573
574
575
576
577
578
579
580
581
582
583
584
585
586
587
588
59
591
592
593
594
595
596
597
598
599
6
60
600
604
605
607
608
609
610
611
613
614
615
616
618
62
620
621
63
632
633
636
637
638
639
64
640
641
642
643
644
645
646
647
649
65
650
651
653
654
655
656
657
658
659
660
661
662
663
664
665
666
667
668
669
670
671
672
674
675
676
677
678
679
68
680
681
682
684
686
687
688
690
692
693
694
695
697
698
699
7
700
706
711
712
728
729
730
731
732
733
734
735
742
743
744
745
749
750
752
753
755
756
757
758
76
760
763
768
769
77
770
771
772
773
776
777
78
780
781
782
783
784
785
786
787
788
789
79
790
791
796
797
798
799
80
800
801
802
803
804
805
806
807
808
809
81
810
811
812
813
814
815
816
817
818
819
820
822
823
824
825
826
827
828
829
830
831
832
833
834
835
836
84
843
844
845
846
847
848
849
85
850
851
852
853
854
86
861
862
863
864
865
866
867
868
869
87
870
871
872
873
875
876
88
881
882
883
884
885
886
887
888
889
890
893
894
895
896
898
899
90
900
901
902
903
904
905
906
907
908
909
910
911
912
913
914
915
916
917
918
919
92
920
921
922
923
924
925
926
927
928
929
930
931
932
933
934
935
936
937
938
939
94
940
941
942
943
944
945
946
947
948
949
950
951
952
953
954
955
956
957
958
959
960
961
962
963
964
965
966
967
968
969
970
971
972
975
976
977
978
981
982
983
984
985
986
987
988
989
990
991
992
993
994
995
996
997
998
999